In [2]:
import pandas as pd 
import numpy as np

In [130]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 28],
    'City': ['New York', 'Paris', 'London', 'Tokyo', 'Berlin'],
    'Salary': [50000, 60000, 70000, 80000, 55000]
}

df = pd.DataFrame(data, index=['a', 'b', 'c', 'd', 'e'])
print(df)

      Name  Age      City  Salary
a    Alice   25  New York   50000
b      Bob   30     Paris   60000
c  Charlie   35    London   70000
d    David   40     Tokyo   80000
e      Eva   28    Berlin   55000

In [131]:
df.loc['a']

Name         Alice
Age             25
City      New York
Salary       50000
Name: a, dtype: object

In [132]:
df.loc['d']

Name      David
Age          40
City      Tokyo
Salary    80000
Name: d, dtype: object

In [134]:
df.loc[['a','c']]

      Name  Age      City  Salary
a    Alice   25  New York   50000
c  Charlie   35    London   70000

In [135]:
df.loc[['c','d']]

      Name  Age    City  Salary
c  Charlie   35  London   70000
d    David   40   Tokyo   80000

In [136]:
df.loc[:,['Name', 'City', 'Salary']]

      Name      City  Salary
a    Alice  New York   50000
b      Bob     Paris   60000
c  Charlie    London   70000
d    David     Tokyo   80000
e      Eva    Berlin   55000

In [137]:
df.loc[:,['Name','Salary']]

      Name  Salary
a    Alice   50000
b      Bob   60000
c  Charlie   70000
d    David   80000
e      Eva   55000

In [138]:
df.loc[['a','d'],['Name','Salary']]

    Name  Salary
a  Alice   50000
d  David   80000

In [139]:
df.loc[:,['Name','City']]

      Name      City
a    Alice  New York
b      Bob     Paris
c  Charlie    London
d    David     Tokyo
e      Eva    Berlin

In [140]:
df.loc[['a','b'], ['Name', 'Age']]

    Name  Age
a  Alice   25
b    Bob   30

In [141]:
df.loc['b':'d','Name':'Salary']

      Name  Age    City  Salary
b      Bob   30   Paris   60000
c  Charlie   35  London   70000
d    David   40   Tokyo   80000

In [142]:
df.iloc[1]

Name        Bob
Age          30
City      Paris
Salary    60000
Name: b, dtype: object

In [143]:
df.iloc[0]

Name         Alice
Age             25
City      New York
Salary       50000
Name: a, dtype: object

In [145]:
df.iloc[['1','2']]

      Name  Age    City  Salary
b      Bob   30   Paris   60000
c  Charlie   35  London   70000

In [151]:
df.iloc[:, [0, 2]]

      Name      City
a    Alice  New York
b      Bob     Paris
c  Charlie    London
d    David     Tokyo
e      Eva    Berlin

In [152]:
df.iloc[:, [0,2]]

      Name      City
a    Alice  New York
b      Bob     Paris
c  Charlie    London
d    David     Tokyo
e      Eva    Berlin

In [154]:
df.iloc[3]

Name      David
Age          40
City      Tokyo
Salary    80000
Name: d, dtype: object

In [155]:
df.iloc[['0','3']]

    Name  Age      City  Salary
a  Alice   25  New York   50000
d  David   40     Tokyo   80000

In [156]:
df.iloc[['2','4']]

      Name  Age    City  Salary
c  Charlie   35  London   70000
e      Eva   28  Berlin   55000

In [158]:
df.iloc[:,[1,2]]

   Age      City
a   25  New York
b   30     Paris
c   35    London
d   40     Tokyo
e   28    Berlin

In [159]:
df.iloc[[1,3],[0,3]]

    Name  Salary
b    Bob   60000
d  David   80000

In [161]:
df.iloc[[0,1]]

    Name  Age      City  Salary
a  Alice   25  New York   50000
b    Bob   30     Paris   60000

In [162]:
df.iloc[1:4,1:4]

   Age    City  Salary
b   30   Paris   60000
c   35  London   70000
d   40   Tokyo   80000

In [170]:
df.loc['d']

Name      David
Age          23
City      Tokyo
Salary    80000
Name: d, dtype: object

In [173]:
df.loc['d','City']= 'New'

In [175]:
df.loc['b', 'Salary'] = 65000
df.loc['b']

Name        Bob
Age          30
City      Paris
Salary    65000
Name: b, dtype: object

In [176]:
df.loc['c','City'] = 'New'
df.loc['c']

Name      Charlie
Age            35
City          New
Salary      70000
Name: c, dtype: object

In [177]:
df.iloc[0,2]='Jan'
df.iloc[0]

Name      Alice
Age          25
City        Jan
Salary    50000
Name: a, dtype: object

In [178]:
import pandas as pd
import numpy as np  # We'll use this to introduce some null values

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 28],
    'City': ['New York', 'Paris', 'London', 'Tokyo', 'Berlin'],
    'Salary': [50000, 60000, 70000, 80000, 55000]
}

df = pd.DataFrame(data, index=['a', 'b', 'c', 'd', 'e'])

# Let's introduce some null values to better demonstrate the difference
df.loc['b', 'Age'] = np.nan
df.loc['c', 'City'] = np.nan

print(df)

      Name   Age      City  Salary
a    Alice  25.0  New York   50000
b      Bob   NaN     Paris   60000
c  Charlie  35.0       NaN   70000
d    David  40.0     Tokyo   80000
e      Eva  28.0    Berlin   55000

In [181]:
df.count(2)

ValueError: No axis named 2 for object type DataFrame

In [182]:
df.count(axis=1)

a    4
b    3
c    3
d    4
e    4
dtype: int64

In [183]:
df.size

20

In [187]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, np.nan, 35, 40, 28],
    'City': ['New York', 'Paris', np.nan, 'Tokyo', 'Berlin'],
    'Salary': [50000, 60000, 70000, 80000, 55000],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR']
}

df = pd.DataFrame(data, index=['a', 'b', 'c', 'd', 'e'])
print(df)

      Name   Age      City  Salary Department
a    Alice  25.0  New York   50000         HR
b      Bob   NaN     Paris   60000         IT
c  Charlie  35.0       NaN   70000    Finance
d    David  40.0     Tokyo   80000         IT
e      Eva  28.0    Berlin   55000         HR

In [188]:
df.count()

Name          5
Age           4
City          4
Salary        5
Department    5
dtype: int64

In [198]:
df[['Name','Age']].count()

Name    5
Age     4
dtype: int64

In [194]:
df[['Name','Age']].count()

Name    5
Age     4
dtype: int64

In [195]:
df.groupby('Department').count()

            Name  Age  City  Salary
Department
Finance        1    1     0       1
HR             2    2     2       2
IT             2    1     2       2

In [199]:
df.count()

Name          5
Age           4
City          4
Salary        5
Department    5
dtype: int64

In [200]:
df.count(axis=1)

a    5
b    4
c    4
d    5
e    5
dtype: int64

In [202]:
df[['Name','Salary']].count()

Name      5
Salary    5
dtype: int64

In [203]:
df.groupby('Department').count()

            Name  Age  City  Salary
Department
Finance        1    1     0       1
HR             2    2     2       2
IT             2    1     2       2

In [204]:
df.groupby('City').count()

          Name  Age  Salary  Department
City
Berlin       1    1       1           1
New York     1    1       1           1
Paris        1    0       1           1
Tokyo        1    1       1           1

In [205]:
df.count()

Name          5
Age           4
City          4
Salary        5
Department    5
dtype: int64

In [206]:
df.count(axis =1 )

a    5
b    4
c    4
d    5
e    5
dtype: int64

In [207]:
df[['Name','City']].count()

Name    5
City    4
dtype: int64

In [208]:
df[['Salary','Department']].count()

Salary        5
Department    5
dtype: int64

In [209]:
df.groupby('City').count()

          Name  Age  Salary  Department
City
Berlin       1    1       1           1
New York     1    1       1           1
Paris        1    0       1           1
Tokyo        1    1       1           1

In [210]:
df.size

25

In [213]:
df.['a'].size

SyntaxError: invalid syntax (1298783503.py, line 1)

In [214]:
df.count()

Name          5
Age           4
City          4
Salary        5
Department    5
dtype: int64

In [215]:
df.count(axis=1)

a    5
b    4
c    4
d    5
e    5
dtype: int64

In [216]:
df[['Name','City']].count()

Name    5
City    4
dtype: int64

In [217]:
df.groupby('City').count()

          Name  Age  Salary  Department
City
Berlin       1    1       1           1
New York     1    1       1           1
Paris        1    0       1           1
Tokyo        1    1       1           1

In [218]:
df.size

25

In [219]:
df[['Age']].size

5

In [220]:
df.size

25

In [222]:
df[['Salary']].size

5

In [227]:
df.loc['a'].size

5

In [230]:
df['Name'].value_counts()

Name
Alice      1
Bob        1
Charlie    1
David      1
Eva        1
Name: count, dtype: int64

In [231]:
df['Department'].value_counts()

Department
HR         2
IT         2
Finance    1
Name: count, dtype: int64

In [232]:
df['Name'].value_counts()

Name
Alice      1
Bob        1
Charlie    1
David      1
Eva        1
Name: count, dtype: int64

In [233]:
df.isna()

    Name    Age   City  Salary  Department
a  False  False  False   False       False
b  False   True  False   False       False
c  False  False   True   False       False
d  False  False  False   False       False
e  False  False  False   False       False

In [234]:
df.notnull()

   Name    Age   City  Salary  Department
a  True   True   True    True        True
b  True  False   True    True        True
c  True   True  False    True        True
d  True   True   True    True        True
e  True   True   True    True        True

In [235]:
df.isna()

    Name    Age   City  Salary  Department
a  False  False  False   False       False
b  False   True  False   False       False
c  False  False   True   False       False
d  False  False  False   False       False
e  False  False  False   False       False

In [236]:
df.notnull()

   Name    Age   City  Salary  Department
a  True   True   True    True        True
b  True  False   True    True        True
c  True   True  False    True        True
d  True   True   True    True        True
e  True   True   True    True        True

In [237]:
df.fillna('YOLO')

      Name   Age      City  Salary Department
a    Alice  25.0  New York   50000         HR
b      Bob  YOLO     Paris   60000         IT
c  Charlie  35.0      YOLO   70000    Finance
d    David  40.0     Tokyo   80000         IT
e      Eva  28.0    Berlin   55000         HR

In [240]:
df.fillna({'Age':0,'City':'Hari'})

      Name   Age      City  Salary Department
a    Alice  25.0  New York   50000         HR
b      Bob   0.0     Paris   60000         IT
c  Charlie  35.0      Hari   70000    Finance
d    David  40.0     Tokyo   80000         IT
e      Eva  28.0    Berlin   55000         HR

In [241]:
df.isna()

    Name    Age   City  Salary  Department
a  False  False  False   False       False
b  False   True  False   False       False
c  False  False   True   False       False
d  False  False  False   False       False
e  False  False  False   False       False

In [242]:
df.notnull()

   Name    Age   City  Salary  Department
a  True   True   True    True        True
b  True  False   True    True        True
c  True   True  False    True        True
d  True   True   True    True        True
e  True   True   True    True        True

In [243]:
df.fillna('hi')

      Name   Age      City  Salary Department
a    Alice  25.0  New York   50000         HR
b      Bob    hi     Paris   60000         IT
c  Charlie  35.0        hi   70000    Finance
d    David  40.0     Tokyo   80000         IT
e      Eva  28.0    Berlin   55000         HR

In [ ]:
df.fillna({'Name':'Hair','Age':})

In [247]:
df.dropna(how='all')

      Name   Age      City  Salary Department
a    Alice  25.0  New York   50000         HR
b      Bob   NaN     Paris   60000         IT
c  Charlie  35.0       NaN   70000    Finance
d    David  40.0     Tokyo   80000         IT
e      Eva  28.0    Berlin   55000         HR

In [244]:
df.dropna()

    Name   Age      City  Salary Department
a  Alice  25.0  New York   50000         HR
d  David  40.0     Tokyo   80000         IT
e    Eva  28.0    Berlin   55000         HR

In [248]:
df.isna()

    Name    Age   City  Salary  Department
a  False  False  False   False       False
b  False   True  False   False       False
c  False  False   True   False       False
d  False  False  False   False       False
e  False  False  False   False       False

In [249]:
df.notnull()

   Name    Age   City  Salary  Department
a  True   True   True    True        True
b  True  False   True    True        True
c  True   True  False    True        True
d  True   True   True    True        True
e  True   True   True    True        True

In [250]:
df.dropna()

    Name   Age      City  Salary Department
a  Alice  25.0  New York   50000         HR
d  David  40.0     Tokyo   80000         IT
e    Eva  28.0    Berlin   55000         HR

In [252]:
df.dropna(how='all')

      Name   Age      City  Salary Department
a    Alice  25.0  New York   50000         HR
b      Bob   NaN     Paris   60000         IT
c  Charlie  35.0       NaN   70000    Finance
d    David  40.0     Tokyo   80000         IT
e      Eva  28.0    Berlin   55000         HR

In [253]:
df.fillna('new')

      Name   Age      City  Salary Department
a    Alice  25.0  New York   50000         HR
b      Bob   new     Paris   60000         IT
c  Charlie  35.0       new   70000    Finance
d    David  40.0     Tokyo   80000         IT
e      Eva  28.0    Berlin   55000         HR

In [ ]:
df.fillna({'Name':'Nahe','Age':'Gah'})

In [254]:
df.fillna("jej")

      Name   Age      City  Salary Department
a    Alice  25.0  New York   50000         HR
b      Bob   jej     Paris   60000         IT
c  Charlie  35.0       jej   70000    Finance
d    David  40.0     Tokyo   80000         IT
e      Eva  28.0    Berlin   55000         HR

In [255]:
df.fillna('js')

      Name   Age      City  Salary Department
a    Alice  25.0  New York   50000         HR
b      Bob    js     Paris   60000         IT
c  Charlie  35.0        js   70000    Finance
d    David  40.0     Tokyo   80000         IT
e      Eva  28.0    Berlin   55000         HR

In [256]:
df.dropna()

    Name   Age      City  Salary Department
a  Alice  25.0  New York   50000         HR
d  David  40.0     Tokyo   80000         IT
e    Eva  28.0    Berlin   55000         HR

In [257]:
df.dropna(how='all')

      Name   Age      City  Salary Department
a    Alice  25.0  New York   50000         HR
b      Bob   NaN     Paris   60000         IT
c  Charlie  35.0       NaN   70000    Finance
d    David  40.0     Tokyo   80000         IT
e      Eva  28.0    Berlin   55000         HR

In [259]:
df.dropna(subset=['City'])

    Name   Age      City  Salary Department
a  Alice  25.0  New York   50000         HR
b    Bob   NaN     Paris   60000         IT
d  David  40.0     Tokyo   80000         IT
e    Eva  28.0    Berlin   55000         HR

In [260]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', np.nan, 'Bob'],
    'City': ['New York', 'Paris', 'London', 'New York', 'Berlin', np.nan],
    'Age': [25, 30, 35, 25, np.nan, 30]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)
print("\n")

Original DataFrame:
      Name      City   Age
0    Alice  New York  25.0
1      Bob     Paris  30.0
2  Charlie    London  35.0
3    Alice  New York  25.0
4      NaN    Berlin   NaN
5      Bob       NaN  30.0

In [261]:
df['Name'].unique()

array(['Alice', 'Bob', 'Charlie', nan], dtype=object)

In [262]:
df['City'].unique()

array(['New York', 'Paris', 'London', 'Berlin', nan], dtype=object)

In [264]:
df.nunique()

Name    3
City    4
Age     3
dtype: int64

In [265]:
df['Name'].nunique()

3

In [268]:
df['Name'].nunique(dropna=False)

4